{"inputs": "TAIPEI (Taiwan News) — Taiwanese computer brand ASUS announced on Thursday (March 24) it will invest NT$540 million (US$18.86 million) in Taiwan Web Service, a local cloud service provider. The move will provide cloud computing services for a range of industries and harness high-efficiency computing power and big data to accelerate the development of the “Artificial Intelligence of Things” (AIoT) and the 5G ecosystem, per a CNA report. The project will continue the evolution of core AI cloud technologies, machine learning, multi-cloud architecture, software-defined data centers, and 5G hybrid cloud platforms. In the future, the platform will be deployed to better serve partners in the manufacturing, medicine, and finance industries as well as smart cities, ASUS stated in a press release. In 2018, ASUS joined with government and industry players in building Taiwania 2, a Taiwan-made supercomputer that was ranked 20th in the world when it came online. ASUS contributed hundreds of AI cloud engineers to the effort to develop and integrate the hardware and software systems. Taiwan Web Service has been involved in several cloud computing projects since it was initiated in 2021, including Academia Sinica’s Hybrid Computing Platform, the Hakka Affairs Councils’ Hakka Speech Database, and the Taoyuan MRT Cloud Platform Project. It has also formed strategic partnerships with NVIDIA Corporation, the Taiwanese NGO Artificial Intelligence Foundation, and other bodies.", "targets": "ASUS, a Taiwanese computer brand, has announced a NT$540 million investment in Taiwan Web Service, a local cloud service provider. The investment aims to provide cloud computing services for various industries and accelerate the development of AIoT and the 5G ecosystem. The project focuses on core AI cloud technologies, machine learning, multi-cloud architecture, software-defined data centers, and 5G hybrid cloud platforms. ASUS plans to deploy the platform to benefit partners in manufacturing, medicine, finance, and smart cities. ASUS previously collaborated on building Taiwania 2, a Taiwan-made supercomputer, and has formed partnerships with organizations such as NVIDIA Corporation and the Taiwanese NGO Artificial Intelligence Foundation."}
{"inputs":"TAIPEI (Taiwan News) — Nvidia Corporation announced last week that two supercomputers will be built with its hardware in Taiwan. At Computex Taipei, which took place between May 30 - June 2, Nvidia announced two out of four new supercomputers will be made with its Grace Hopper hardware in Taiwan, reported HPC Wire. The two in Taiwan will be Taiwania 4 and Taipei-1, while the other two will be Helios and Israel-1. Taiwania 4 will be composed of 44 nodes powered by Nvidia's Grace CPU Superchip, which consists of two Arm-based Grace CPUs in one package. These nodes will be networked using the firm's Quantum-2 InfiniBand. This supercomputer will be constructed by ASUS and located at the National Center for High-Performance Computing (NCHC) which is operated by the National Applied Research Laboratories (NARLabs). The NCHC is reportedly planning to use Taiwania 4 for atmospheric modeling to deal with global warming while using one of the "most energy-efficient CPU-based supercomputers in Asia," stated NCHC. Nvidia will own and operate Taipei-1, which is expected to have a wider range of uses. It will feature 64 DGX H100 systems and 64 Omniverse-focused OVX systems. Each DGX will include eight H100 GPUs and two Intel Xeon Platinum 8480C CPUs with a supercomputer designed for "heavy AI workloads," reported Data Center Dynamics, while each OVX will have four L40 GPUs and a BlueField-3 DPU. Along with climate science, applications planned for the new system include healthcare, robotics, and industrial digital twins. National Taiwan University will be one of the supercomputer's first users and will utilize the system to study speech learning by large language models (LLMs).", "targets":"Nvidia has announced plans to build two supercomputers in Taiwan using its Grace Hopper hardware. The announcement was made during the Computex Taipei event, with HPC Wire reporting that two out of the four new supercomputers will be named Taiwania 4 and Taipei-1. Taiwania 4 will consist of 44 nodes powered by Nvidia's Grace CPU Superchip, which features two Arm-based Grace CPUs in a single package. The nodes will be interconnected using Nvidia's Quantum-2 InfiniBand technology. ASUS will handle the construction of Taiwania 4, located at the National Center for High-Performance Computing (NCHC) operated by the National Applied Research Laboratories (NARLabs). NCHC plans to utilize Taiwania 4 for atmospheric modeling to address global warming, highlighting its energy-efficient nature. Taipei-1, owned and operated by Nvidia, is expected to have a broader range of applications. It will include 64 DGX H100 systems and 64 OVX systems focused on Omniverse. Each DGX system will consist of eight H100 GPUs and two Intel Xeon Platinum 8480C CPUs, designed for heavy AI workloads. The OVX systems will feature four L40 GPUs and a BlueField-3 DPU. In addition to climate science, the new supercomputers will be employed in fields such as healthcare, robotics, and industrial digital twins. National Taiwan University is among the first users of these supercomputers and will employ them for studying speech learning with large language models (LLMs)."}